tutorials/incompressible/pimpleFoam/laminar/mixerVesselAMI2D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolver    solidBody;

cellZone        rotor;

solidBodyMotionFunction  rotatingMotion;

origin        (0 0 0);
axis          (0 0 1);
omega         6.2832; // rad/s

// ************************************************************************* //
